fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВКМ_МассовоеСозданиеАктов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТЧ_Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТЧ_Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКМ_АбонентскоеОбслуживание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОбработкаЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем АдресЗадания; // Переменная модуля формы для хранения адреса ID задания

&НаКлиенте
Процедура Заполнить(Команда) 
	
	ЗаполнитьНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	// Очищаем таблицу перед заполнением
	Объект.СписокДоговоров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Договор,
		|	ЕСТЬNULL(Реализации.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
		|		ПО (Реализации.Договор = Договоры.Ссылка)
		|			И (НАЧАЛОПЕРИОДА(Реализации.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ))
		|			И (НЕ Реализации.ПометкаУдаления)
		|ГДЕ
		|	Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И НЕ Договоры.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	
		Объект.СписокДоговоров.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.ТЧ_Договор = Выборка.Договор;
		НоваяСтрока.ТЧ_Реализация = Выборка.Реализация;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
Если Объект.СписокДоговоров.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Список договоров пуст!");
		Возврат;
	КонецЕсли;
	
	// Подготовка параметров для передачи в фоновое задание
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Период", Объект.Период);
	
	МассивДоговоров = Новый Массив;
	Для Каждого Стр Из Объект.СписокДоговоров Цикл
		
		// ИСПРАВЛЕНИЕ ЗДЕСЬ: тоже используем ТЧ_Реализация и ТЧ_Договор
		Если Стр.ТЧ_Реализация.Пустая() Тогда
			МассивДоговоров.Добавить(Стр.ТЧ_Договор);
		КонецЕсли;
		
	КонецЦикла;
	ПараметрыЗадания.Вставить("МассивДоговоров", МассивДоговоров);
	
	Если МассивДоговоров.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Все документы уже созданы.");
		Возврат;
	КонецЕсли;

	// Запуск фонового задания
	АдресЗадания = ЗапуститьФоновоеЗаданиеНаСервере(ПараметрыЗадания);
	
	// Подключаем обработчик ожидания, который будет проверять статус задания
	ПодключитьОбработчикОжидания("ПроверитьСостояниеЗадания", 2); // каждые 2 секунды
	
	ПоказатьПользователюСообщение("Запущено создание документов..."); 
	
КонецПроцедуры 

&НаСервере  
Функция ЗапуститьФоновоеЗаданиеНаСервере(Параметры)
	
	ИмяМетода = "ВКМ_ОбслуживаниеСервер.ВыполнитьСоздание";
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Параметры);
	
	Задание = ФоновыеЗадания.Выполнить(ИмяМетода, МассивПараметров, Новый УникальныйИдентификатор, "Создание актов");
	
	// Помещаем ID задания во временное хранилище
	Адрес = ПоместитьВоВременноеХранилище(Задание.УникальныйИдентификатор, УникальныйИдентификатор);
	
	// Возвращаем этот адрес на Клиент
	Возврат Адрес; 
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСостояниеЗадания()
	
	Если ЗаданиеВыполнено(АдресЗадания) Тогда
		ОтключитьОбработчикОжидания("ПроверитьСостояниеЗадания");
		ПоказатьПользователюСообщение("Создание документов завершено!");
		// Обновляем список, чтобы увидеть созданные документы
		Заполнить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено(Адрес)
	
	ИдЗадания = ПолучитьИзВременногоХранилища(Адрес);
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдЗадания);
	
	Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	Иначе
		// Задание завершено (успешно или с ошибкой)
		Если Задание.ИнформацияОбОшибке <> Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка в фоновом задании: " + Задание.ИнформацияОбОшибке.Описание;
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПользователюСообщение(Текст)
	ПоказатьОповещениеПользователя("Массовое создание", , Текст);
КонецПроцедуры
